cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>TIMER_A2</name>
        <version>356.0</version>
        <description>TIMER_A2</description>
        <baseAddress>0x40000800</baseAddress>
        <interrupt>
            <name>TA2_0_IRQ</name>
            <description>TA2_0 Interrupt</description>
            <value>12</value>
        </interrupt>
        <interrupt>
            <name>TA2_N_IRQ</name>
            <description>TA2_N Interrupt</description>
            <value>13</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x30</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>TAxCTL</name>
                  <displayName>CTL</displayName>
                  <description>TimerAx Control Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>TAIFG</name>
                        <description>TimerA interrupt flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>TAIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TAIE</name>
                        <description>TimerA interrupt enable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>TAIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TAIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TACLR</name>
                        <description>TimerA clear</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MC</name>
                        <description>Mode control</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>MC_0</name>
                                <description>Stop mode: Timer is halted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MC_1</name>
                                <description>Up mode: Timer counts up to TAxCCR0</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MC_2</name>
                                <description>Continuous mode: Timer counts up to 0FFFFh</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>MC_3</name>
                                <description>Up/down mode: Timer counts up to TAxCCR0 then down to 0000h</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ID</name>
                        <description>Input divider</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ID_0</name>
                                <description>/1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ID_1</name>
                                <description>/2</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ID_2</name>
                                <description>/4</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ID_3</name>
                                <description>/8</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>TASSEL</name>
                        <description>TimerA clock source select</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>TASSEL_0</name>
                                <description>TAxCLK</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TASSEL_1</name>
                                <description>ACLK</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TASSEL_2</name>
                                <description>SMCLK</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>TASSEL_3</name>
                                <description>INCLK</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <dim>5</dim>
                  <dimIncrement>2</dimIncrement>
                  <dimIndex>0,1,2,3,4</dimIndex>
                  <name>TAxCCTL[%s]</name>
                  <displayName>CCTL[%s]</displayName>
                  <description>Timer_A Capture/Compare Control Register</description>
                  <addressOffset>0x2</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000fff7</resetMask>
                  <fields>
                    <field>
                        <name>CCIFG</name>
                        <description>Capture/compare interrupt flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CCIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CCIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>COV</name>
                        <description>Capture overflow</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>COV_0</name>
                                <description>No capture overflow occurred</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>COV_1</name>
                                <description>Capture overflow occurred</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>OUT</name>
                        <description>Output</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>OUT_0</name>
                                <description>Output low</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>OUT_1</name>
                                <description>Output high</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CCI</name>
                        <description>Capture/compare input</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>CCIE</name>
                        <description>Capture/compare interrupt enable</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CCIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CCIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>OUTMOD</name>
                        <description>Output mode</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>OUTMOD_0</name>
                                <description>OUT bit value</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>OUTMOD_1</name>
                                <description>Set</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>OUTMOD_2</name>
                                <description>Toggle/reset</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>OUTMOD_3</name>
                                <description>Set/reset</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>OUTMOD_4</name>
                                <description>Toggle</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>OUTMOD_5</name>
                                <description>Reset</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>OUTMOD_6</name>
                                <description>Toggle/set</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>OUTMOD_7</name>
                                <description>Reset/set</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CAP</name>
                        <description>Capture mode</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CAP_0</name>
                                <description>Compare mode</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAP_1</name>
                                <description>Capture mode</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>SCCI</name>
                        <description>Synchronized capture/compare input</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>SCS</name>
                        <description>Synchronize capture source</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>SCS_0</name>
                                <description>Asynchronous capture</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SCS_1</name>
                                <description>Synchronous capture</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CCIS</name>
                        <description>Capture/compare input select</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CCIS_0</name>
                                <description>CCIxA</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CCIS_1</name>
                                <description>CCIxB</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CCIS_2</name>
                                <description>GND</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CCIS_3</name>
                                <description>VCC</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CM</name>
                        <description>Capture mode</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CM_0</name>
                                <description>No capture</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CM_1</name>
                                <description>Capture on rising edge</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CM_2</name>
                                <description>Capture on falling edge</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CM_3</name>
                                <description>Capture on both rising and falling edges</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>TAxR</name>
                  <displayName>R</displayName>
                  <description>TimerA register</description>
                  <addressOffset>0x10</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
            </register>
            <register>
                  <dim>5</dim>
                  <dimIncrement>2</dimIncrement>
                  <dimIndex>0,1,2,3,4</dimIndex>
                  <name>TAxCCR[%s]</name>
                  <displayName>CCR[%s]</displayName>
                  <description>Timer_A Capture/Compare  Register</description>
                  <addressOffset>0x12</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>TAxR</name>
                        <description>TimerA register</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
