cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
            <register>
                  <name>UCAxIE</name>
                  <displayName>IE</displayName>
                  <description>eUSCI_Ax Interrupt Enable Register</description>
                  <addressOffset>0x1A</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCRXIE</name>
                        <description>Receive interrupt enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCRXIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCRXIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXIE</name>
                        <description>Transmit interrupt enable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSTTIE</name>
                        <description>Start bit interrupt enable</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSTTIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSTTIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXCPTIE</name>
                        <description>Transmit complete interrupt enable</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXCPTIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXCPTIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCAxIFG</name>
                  <displayName>IFG</displayName>
                  <description>eUSCI_Ax Interrupt Flag Register</description>
                  <addressOffset>0x1C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000002</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCRXIFG</name>
                        <description>Receive interrupt flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCRXIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCRXIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXIFG</name>
                        <description>Transmit interrupt flag</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSTTIFG</name>
                        <description>Start bit interrupt flag</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSTTIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSTTIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXCPTIFG</name>
                        <description>Transmit ready interrupt enable</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXCPTIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXCPTIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCAxIV</name>
                  <displayName>IV</displayName>
                  <description>eUSCI_Ax Interrupt Vector Register</description>
                  <addressOffset>0x1E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCIV</name>
                        <description>eUSCI_A interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>UCIV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>UCIV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_2</name>
                                <description>Interrupt Source: Receive buffer full; Interrupt Flag: UCRXIFG; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_4</name>
                                <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_6</name>
                                <description>Interrupt Source: Start bit received; Interrupt Flag: UCSTTIFG</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_8</name>
                                <description>Interrupt Source: Transmit complete; Interrupt Flag: UCTXCPTIFG; Interrupt Priority: Lowest</description>
                                <value>8</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
