cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
            <register>
                  <name>UCBxIFG</name>
                  <displayName>IFG</displayName>
                  <description>eUSCI_Bx Interrupt Flag Register</description>
                  <addressOffset>0x2C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000002</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCRXIFG0</name>
                        <description>eUSCI_B receive interrupt flag 0</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCRXIFG0_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCRXIFG0_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXIFG0</name>
                        <description>eUSCI_B transmit interrupt flag 0</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXIFG0_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXIFG0_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSTTIFG</name>
                        <description>START condition interrupt flag</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSTTIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSTTIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCSTPIFG</name>
                        <description>STOP condition interrupt flag</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCSTPIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCSTPIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCALIFG</name>
                        <description>Arbitration lost interrupt flag</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCALIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCALIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCNACKIFG</name>
                        <description>Not-acknowledge received interrupt flag</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCNACKIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCNACKIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCBCNTIFG</name>
                        <description>Byte counter interrupt flag</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCBCNTIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCBCNTIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCCLTOIFG</name>
                        <description>Clock low timeout interrupt flag</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCCLTOIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCCLTOIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCRXIFG1</name>
                        <description>eUSCI_B receive interrupt flag 1</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCRXIFG1_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCRXIFG1_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXIFG1</name>
                        <description>eUSCI_B transmit interrupt flag 1</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXIFG1_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXIFG1_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCRXIFG2</name>
                        <description>eUSCI_B receive interrupt flag 2</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCRXIFG2_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCRXIFG2_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXIFG2</name>
                        <description>eUSCI_B transmit interrupt flag 2</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXIFG2_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXIFG2_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCRXIFG3</name>
                        <description>eUSCI_B receive interrupt flag 3</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCRXIFG3_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCRXIFG3_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCTXIFG3</name>
                        <description>eUSCI_B transmit interrupt flag 3</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCTXIFG3_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCTXIFG3_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>UCBIT9IFG</name>
                        <description>Bit position 9 interrupt flag</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>UCBIT9IFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCBIT9IFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>UCBxIV</name>
                  <displayName>IV</displayName>
                  <description>eUSCI_Bx Interrupt Vector Register</description>
                  <addressOffset>0x2E</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>UCIV</name>
                        <description>eUSCI_B interrupt vector value</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>UCIV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>UCIV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_2</name>
                                <description>Interrupt Source: Arbitration lost; Interrupt Flag: UCALIFG; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_4</name>
                                <description>Interrupt Source: Not acknowledgment; Interrupt Flag: UCNACKIFG</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_6</name>
                                <description>Interrupt Source: Start condition received; Interrupt Flag: UCSTTIFG</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_8</name>
                                <description>Interrupt Source: Stop condition received; Interrupt Flag: UCSTPIFG</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_10</name>
                                <description>Interrupt Source: Slave 3 Data received; Interrupt Flag: UCRXIFG3</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_12</name>
                                <description>Interrupt Source: Slave 3 Transmit buffer empty; Interrupt Flag: UCTXIFG3</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_14</name>
                                <description>Interrupt Source: Slave 2 Data received; Interrupt Flag: UCRXIFG2</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_16</name>
                                <description>Interrupt Source: Slave 2 Transmit buffer empty; Interrupt Flag: UCTXIFG2</description>
                                <value>16</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_18</name>
                                <description>Interrupt Source: Slave 1 Data received; Interrupt Flag: UCRXIFG1</description>
                                <value>18</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_20</name>
                                <description>Interrupt Source: Slave 1 Transmit buffer empty; Interrupt Flag: UCTXIFG1</description>
                                <value>20</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_22</name>
                                <description>Interrupt Source: Data received; Interrupt Flag: UCRXIFG0</description>
                                <value>22</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_24</name>
                                <description>Interrupt Source: Transmit buffer empty; Interrupt Flag: UCTXIFG0</description>
                                <value>24</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_26</name>
                                <description>Interrupt Source: Byte counter zero; Interrupt Flag: UCBCNTIFG</description>
                                <value>26</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_28</name>
                                <description>Interrupt Source: Clock low timeout; Interrupt Flag: UCCLTOIFG</description>
                                <value>28</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>UCIV_30</name>
                                <description>Interrupt Source: Nineth bit position; Interrupt Flag: UCBIT9IFG; Priority: Lowest</description>
                                <value>30</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
