cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
            <register>
                  <name>CExIV</name>
                  <displayName>IV</displayName>
                  <description>Comparator Interrupt Vector Word Register</description>
                  <addressOffset>0xE</addressOffset>
                  <size>16</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CEIV</name>
                        <description>Comparator interrupt vector word register</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>CEIV_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>CEIV_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIV_2</name>
                                <description>Interrupt Source: CEOUT interrupt; Interrupt Flag: CEIFG; Interrupt Priority: Highest</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIV_4</name>
                                <description>Interrupt Source: CEOUT interrupt inverted polarity; Interrupt Flag: CEIIFG</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CEIV_10</name>
                                <description>Interrupt Source: Comparator ready interrupt; Interrupt Flag: CERDYIFG; Interrupt Priority: Lowest</description>
                                <value>10</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>AES256</name>
        <version>356.0</version>
        <description>AES256</description>
        <baseAddress>0x40003C00</baseAddress>
        <interrupt>
            <name>AES256_IRQ</name>
            <description>AES256 Interrupt</description>
            <value>28</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>AESACTL0</name>
                  <displayName>CTL0</displayName>
                  <description>AES Accelerator Control Register 0</description>
                  <addressOffset>0x0</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>AESOPx</name>
                        <description>AES operation</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AESOPx_0</name>
                                <description>Encryption</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESOPx_1</name>
                                <description>Decryption. The provided key is the same key used for encryption</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESOPx_2</name>
                                <description>Generate first round key required for decryption</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESOPx_3</name>
                                <description>Decryption. The provided key is the first round key required for decryption</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AESKLx</name>
                        <description>AES key length</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AESKLx_0</name>
                                <description>AES128. The key size is 128 bit</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESKLx_1</name>
                                <description>AES192. The key size is 192 bit.</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESKLx_2</name>
                                <description>AES256. The key size is 256 bit</description>
                                <value>2</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AESCMx</name>
                        <description>AES cipher mode select</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AESCMx_0</name>
                                <description>ECB</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESCMx_1</name>
                                <description>CBC</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESCMx_2</name>
                                <description>OFB</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESCMx_3</name>
                                <description>CFB</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AESSWRST</name>
                        <description>AES software reset</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AESSWRST_0</name>
                                <description>No reset</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESSWRST_1</name>
                                <description>Reset AES accelerator module</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AESRDYIFG</name>
                        <description>AES ready interrupt flag</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AESRDYIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESRDYIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AESERRFG</name>
                        <description>AES error flag</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AESERRFG_0</name>
                                <description>No error</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESERRFG_1</name>
                                <description>Error occurred</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AESRDYIE</name>
                        <description>AES ready interrupt enable</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AESRDYIE_0</name>
                                <description>Interrupt disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESRDYIE_1</name>
                                <description>Interrupt enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AESCMEN</name>
                        <description>AES cipher mode enable</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AESCMEN_0</name>
                                <description>No DMA triggers are generated</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESCMEN_1</name>
                                <description>DMA ciphermode support operation is enabled and the corresponding DMA triggers are generated</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>AESACTL1</name>
                  <displayName>CTL1</displayName>
                  <description>AES Accelerator Control Register 1</description>
                  <addressOffset>0x2</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>AESBLKCNTx</name>
                        <description>Cipher Block Counter</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>AESASTAT</name>
                  <displayName>STAT</displayName>
                  <description>AES Accelerator Status Register</description>
                  <addressOffset>0x4</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>AESBUSY</name>
                        <description>AES accelerator module busy</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AESBUSY_0</name>
                                <description>Not busy</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESBUSY_1</name>
                                <description>Busy</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AESKEYWR</name>
                        <description>All 16 bytes written to AESAKEY</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AESKEYWR_0</name>
                                <description>Not all bytes written</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESKEYWR_1</name>
                                <description>All bytes written</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AESDINWR</name>
                        <description>All 16 bytes written to AESADIN, AESAXDIN or AESAXIN</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>AESDINWR_0</name>
                                <description>Not all bytes written</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESDINWR_1</name>
                                <description>All bytes written</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AESDOUTRD</name>
                        <description>All 16 bytes read from AESADOUT</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>AESDOUTRD_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>AESDOUTRD_0</name>
                                <description>Not all bytes read</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>AESDOUTRD_1</name>
                                <description>All bytes read</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>AESKEYCNTx</name>
                        <description>Bytes written via AESAKEY for AESKLx=00, half-words written via AESAKEY</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>AESDINCNTx</name>
                        <description>Bytes written via AESADIN, AESAXDIN or AESAXIN</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>AESDOUTCNTx</name>
                        <description>Bytes read via AESADOUT</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>AESAKEY</name>
                  <displayName>KEY</displayName>
                  <description>AES Accelerator Key Register</description>
                  <addressOffset>0x6</addressOffset>
                  <size>16</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>AESKEY0x</name>
                        <description>AES key byte n when AESAKEY is written as half-word</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>AESKEY1x</name>
                        <description>AES key byte n+1 when AESAKEY is written as half-word</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>AESADIN</name>
                  <displayName>DIN</displayName>
                  <description>AES Accelerator Data In Register</description>
                  <addressOffset>0x8</addressOffset>
                  <size>16</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>AESDIN0x</name>
                        <description>AES data in byte n when AESADIN is written as half-word</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>AESDIN1x</name>
                        <description>AES data in byte n+1 when AESADIN is written as half-word</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>AESADOUT</name>
                  <displayName>DOUT</displayName>
                  <description>AES Accelerator Data Out Register</description>
                  <addressOffset>0xA</addressOffset>
                  <size>16</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>AESDOUT0x</name>
                        <description>AES data out byte n when AESADOUT is read as half-word</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>AESDOUT1x</name>
                        <description>AES data out byte n+1 when AESADOUT is read as half-word</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
