cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
            <register>
                  <name>P7MAP45</name>
                  <displayName>P7MAP45</displayName>
                  <description>Port mapping register, P7.4 and P7.5</description>
                  <addressOffset>0x3C</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>P7MAP67</name>
                  <displayName>P7MAP67</displayName>
                  <description>Port mapping register, P7.6 and P7.7</description>
                  <addressOffset>0x3E</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>PMAPx</name>
                        <description>Selects secondary port function</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
        </registers>
    </peripheral>
    <peripheral>
        <name>CAPTIO0</name>
        <version>356.0</version>
        <description>CAPTIO0</description>
        <baseAddress>0x40005400</baseAddress>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x10</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>CAPTIOxCTL</name>
                  <displayName>CTL</displayName>
                  <description>Capacitive Touch IO x Control Register</description>
                  <addressOffset>0xE</addressOffset>
                  <size>16</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x0000ffff</resetMask>
                  <fields>
                    <field>
                        <name>CAPTIOPISELx</name>
                        <description>Capacitive Touch IO pin select</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CAPTIOPISELx_0</name>
                                <description>Px.0</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPISELx_1</name>
                                <description>Px.1</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPISELx_2</name>
                                <description>Px.2</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPISELx_3</name>
                                <description>Px.3</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPISELx_4</name>
                                <description>Px.4</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPISELx_5</name>
                                <description>Px.5</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPISELx_6</name>
                                <description>Px.6</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPISELx_7</name>
                                <description>Px.7</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CAPTIOPOSELx</name>
                        <description>Capacitive Touch IO port select</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_0</name>
                                <description>Px = PJ</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_1</name>
                                <description>Px = P1</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_2</name>
                                <description>Px = P2</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_3</name>
                                <description>Px = P3</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_4</name>
                                <description>Px = P4</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_5</name>
                                <description>Px = P5</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_6</name>
                                <description>Px = P6</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_7</name>
                                <description>Px = P7</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_8</name>
                                <description>Px = P8</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_9</name>
                                <description>Px = P9</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_10</name>
                                <description>Px = P10</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_11</name>
                                <description>Px = P11</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_12</name>
                                <description>Px = P12</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_13</name>
                                <description>Px = P13</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_14</name>
                                <description>Px = P14</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOPOSELx_15</name>
                                <description>Px = P15</description>
                                <value>15</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CAPTIOEN</name>
                        <description>Capacitive Touch IO enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>CAPTIOEN_0</name>
                                <description>All Capacitive Touch IOs are disabled. Signal towards timers is 0.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOEN_1</name>
                                <description>Selected Capacitive Touch IO is enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CAPTIOSTATE</name>
                        <description>Capacitive Touch IO state</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>CAPTIOSTATE_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>CAPTIOSTATE_0</name>
                                <description>Curent state 0 or Capacitive Touch IO is disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CAPTIOSTATE_1</name>
                                <description>Current state 1</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
