cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
Writing to a bit where a DMA channel is not implemented has no effect.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_USEBURSTCLR</name>
                  <displayName>USEBURSTCLR</displayName>
                  <description>Channel Useburst Clear Register</description>
                  <addressOffset>0x101C</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>CLR</name>
                        <description>Set the appropriate bit to enable dma_sreq to generate requests.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_0</name>
                                <description>No effect.
Use the DMA_USEBURST_SET Register to disable dma_sreq from generating requests.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CLR_1</name>
                                <description>Enables dma_sreq[C] to generate DMA requests.
Writing to a bit where a DMA channel is not implemented has no effect.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_REQMASKSET</name>
                  <displayName>REQMASKSET</displayName>
                  <description>Channel Request Mask Set Register</description>
                  <addressOffset>0x1020</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>SET</name>
                        <description>Returns the request mask status of dma_req and dma_sreq, or
disables the corresponding channel from generating DMA requests.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <name>SET_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>SET_0_READ</name>
                                <description>External requests are enabled for channel C.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_1_READ</name>
                                <description>External requests are disabled for channel C.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                        <enumeratedValues>
                            <name>SET_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>SET_0_WRITE</name>
                                <description>No effect.
Use the DMA_REQMASKCLR Register to enable DMA requests.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>SET_1_WRITE</name>
                                <description>Disables dma_req[C] and dma_sreq[C] from generating DMA requests.
Writing to a bit where a DMA channel is not implemented has no effect.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DMA_REQMASKCLR</name>
                  <displayName>REQMASKCLR</displayName>
                  <description>Channel Request Mask Clear Register</description>
                  <addressOffset>0x1024</addressOffset>
                  <size>32</size>
                  <access>write-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>CLR</name>
                        <description>Set the appropriate bit to enable DMA requests for the channel
corresponding to dma_req and dma_sreq.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>write-only</access>
                        <enumeratedValues>
                            <name>CLR_enum_write</name>
                            <usage>write</usage>
                            <enumeratedValue>
                                <name>CLR_0</name>
                                <description>No effect.
Use the DMA_REQMASKSET Register to disable dma_req and
