cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
            <register>
                  <name>CSIFG</name>
                  <displayName>IFG</displayName>
                  <description>Interrupt Flag Register</description>
                  <addressOffset>0x48</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000001</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LFXTIFG</name>
                        <description>LFXT oscillator fault flag</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>LFXTIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>LFXTIFG_0</name>
                                <description>No fault condition occurred after the last reset</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LFXTIFG_1</name>
                                <description>LFXT fault. A LFXT fault occurred after the last reset</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HFXTIFG</name>
                        <description>HFXT oscillator fault flag</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>HFXTIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>HFXTIFG_0</name>
                                <description>No fault condition occurred after the last reset</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXTIFG_1</name>
                                <description>HFXT fault. A HFXT fault occurred after the last reset</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>HFXT2IFG</name>
                        <description>HFXT2 oscillator fault flag</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>HFXT2IFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>HFXT2IFG_0</name>
                                <description>No fault condition occurred after the last reset</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>HFXT2IFG_1</name>
                                <description>HFXT2 fault. A HFXT2 fault occurred after the last reset</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DCOR_SHTIFG</name>
                        <description>DCO external resistor short circuit fault flag.</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>DCOR_SHTIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>DCOR_SHTIFG_0</name>
                                <description>DCO external resistor present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCOR_SHTIFG_1</name>
                                <description>DCO external resistor short circuit fault</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DCOR_OPNIFG</name>
                        <description>DCO external resistor open circuit fault flag.</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>DCOR_OPNIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>DCOR_OPNIFG_0</name>
                                <description>DCO external resistor present</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>DCOR_OPNIFG_1</name>
                                <description>DCO external resistor open circuit fault</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FCNTLFIFG</name>
                        <description>Start fault counter interrupt flag LFXT</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>FCNTLFIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>FCNTLFIFG_0</name>
                                <description>Start counter not expired</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTLFIFG_1</name>
                                <description>Start counter expired</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FCNTHFIFG</name>
                        <description>Start fault counter interrupt flag HFXT</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>FCNTHFIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>FCNTHFIFG_0</name>
                                <description>Start counter not expired</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTHFIFG_1</name>
                                <description>Start counter expired</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>FCNTHF2IFG</name>
                        <description>Start fault counter interrupt flag HFXT2</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>FCNTHF2IFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>FCNTHF2IFG_0</name>
                                <description>Start counter not expired</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>FCNTHF2IFG_1</name>
                                <description>Start counter expired</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PLLOOLIFG</name>
                        <description>PLL out-of-lock interrupt flag</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>PLLOOLIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>PLLOOLIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PLLOOLIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PLLLOSIFG</name>
                        <description>PLL loss-of-signal interrupt flag</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>PLLLOSIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>PLLLOSIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PLLLOSIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>PLLOORIFG</name>
                        <description>PLL out-of-range interrupt flag</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>PLLOORIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>PLLOORIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>PLLOORIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>CALIFG</name>
                        <description>REFCNT period counter expired</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>CALIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>CALIFG_0</name>
                                <description>REFCNT period counter not expired</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>CALIFG_1</name>
                                <description>REFCNT period counter expired</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
