cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>ADC14</name>
        <version>356.0</version>
        <description>ADC14</description>
        <baseAddress>0x40012000</baseAddress>
        <interrupt>
            <name>ADC14_IRQ</name>
            <description>ADC14 Interrupt</description>
            <value>24</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x158</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>ADC14CTL0</name>
                  <displayName>CTL0</displayName>
                  <description>Control 0 Register</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADC14SC</name>
                        <description>ADC14 start conversion</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14SC_0</name>
                                <description>No sample-and-conversion-start</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SC_1</name>
                                <description>Start sample-and-conversion</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14ENC</name>
                        <description>ADC14 enable conversion</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14ENC_0</name>
                                <description>ADC14 disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14ENC_1</name>
                                <description>ADC14 enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14ON</name>
                        <description>ADC14 on</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14ON_0</name>
                                <description>ADC14 off</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14ON_1</name>
                                <description>ADC14 on. ADC core is ready to power up when a valid conversion is triggered.</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14MSC</name>
                        <description>ADC14 multiple sample and conversion</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14MSC_0</name>
                                <description>The sampling timer requires a rising edge of the SHI signal to trigger each sample-and-convert</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14MSC_1</name>
                                <description>The first rising edge of the SHI signal triggers the sampling timer, but further sample-and-conversions are performed automatically as soon as the prior conversion is completed</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14SHT0</name>
                        <description>ADC14 sample-and-hold time</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14SHT0_0</name>
                                <description>4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT0_1</name>
                                <description>8</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT0_2</name>
                                <description>16</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT0_3</name>
                                <description>32</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT0_4</name>
                                <description>64</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT0_5</name>
                                <description>96</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT0_6</name>
                                <description>128</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT0_7</name>
                                <description>192</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14SHT1</name>
                        <description>ADC14 sample-and-hold time</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14SHT1_0</name>
                                <description>4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT1_1</name>
                                <description>8</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT1_2</name>
                                <description>16</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT1_3</name>
                                <description>32</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT1_4</name>
                                <description>64</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT1_5</name>
                                <description>96</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT1_6</name>
                                <description>128</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHT1_7</name>
                                <description>192</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14BUSY</name>
                        <description>ADC14 busy</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14BUSY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14BUSY_0</name>
                                <description>No operation is active</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14BUSY_1</name>
                                <description>A sequence, sample, or conversion is active</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14CONSEQ</name>
                        <description>ADC14 conversion sequence mode select</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14CONSEQ_0</name>
                                <description>Single-channel, single-conversion</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14CONSEQ_1</name>
                                <description>Sequence-of-channels</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14CONSEQ_2</name>
                                <description>Repeat-single-channel</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14CONSEQ_3</name>
                                <description>Repeat-sequence-of-channels</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14SSEL</name>
                        <description>ADC14 clock source select</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14SSEL_0</name>
                                <description>MODCLK</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SSEL_1</name>
                                <description>SYSCLK</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SSEL_2</name>
                                <description>ACLK</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SSEL_3</name>
                                <description>MCLK</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SSEL_4</name>
                                <description>SMCLK</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SSEL_5</name>
                                <description>HSMCLK</description>
                                <value>5</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14DIV</name>
                        <description>ADC14 clock divider</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14DIV_0</name>
                                <description>/1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14DIV_1</name>
                                <description>/2</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14DIV_2</name>
                                <description>/3</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14DIV_3</name>
                                <description>/4</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14DIV_4</name>
                                <description>/5</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14DIV_5</name>
                                <description>/6</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14DIV_6</name>
                                <description>/7</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14DIV_7</name>
                                <description>/8</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14ISSH</name>
                        <description>ADC14 invert signal sample-and-hold</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14ISSH_0</name>
                                <description>The sample-input signal is not inverted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14ISSH_1</name>
                                <description>The sample-input signal is inverted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14SHP</name>
                        <description>ADC14 sample-and-hold pulse-mode select</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14SHP_0</name>
                                <description>SAMPCON signal is sourced from the sample-input signal</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHP_1</name>
                                <description>SAMPCON signal is sourced from the sampling timer</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14SHS</name>
                        <description>ADC14 sample-and-hold source select</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14SHS_0</name>
                                <description>ADC14SC bit</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHS_1</name>
                                <description>See device-specific data sheet for source</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHS_2</name>
                                <description>See device-specific data sheet for source</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHS_3</name>
                                <description>See device-specific data sheet for source</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHS_4</name>
                                <description>See device-specific data sheet for source</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHS_5</name>
                                <description>See device-specific data sheet for source</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHS_6</name>
                                <description>See device-specific data sheet for source</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14SHS_7</name>
                                <description>See device-specific data sheet for source</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14PDIV</name>
                        <description>ADC14 predivider</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14PDIV_0</name>
                                <description>Predivide by 1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14PDIV_1</name>
                                <description>Predivide by 4</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14PDIV_2</name>
                                <description>Predivide by 32</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14PDIV_3</name>
                                <description>Predivide by 64</description>
