cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
            <register>
                  <dim>32</dim>
                  <dimIncrement>4</dimIncrement>
                  <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                  <name>ADC14MCTL[%s]</name>
                  <displayName>MCTL[%s]</displayName>
                  <description>Conversion Memory Control Register</description>
                  <addressOffset>0x18</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADC14INCH</name>
                        <description>Input channel select</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14INCH_0</name>
                                <description>If ADC14DIF = 0: A0; If ADC14DIF = 1: Ain+ = A0, Ain- = A1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_1</name>
                                <description>If ADC14DIF = 0: A1; If ADC14DIF = 1: Ain+ = A0, Ain- = A1</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_2</name>
                                <description>If ADC14DIF = 0: A2; If ADC14DIF = 1: Ain+ = A2, Ain- = A3</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_3</name>
                                <description>If ADC14DIF = 0: A3; If ADC14DIF = 1: Ain+ = A2, Ain- = A3</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_4</name>
                                <description>If ADC14DIF = 0: A4; If ADC14DIF = 1: Ain+ = A4, Ain- = A5</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_5</name>
                                <description>If ADC14DIF = 0: A5; If ADC14DIF = 1: Ain+ = A4, Ain- = A5</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_6</name>
                                <description>If ADC14DIF = 0: A6; If ADC14DIF = 1: Ain+ = A6, Ain- = A7</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_7</name>
                                <description>If ADC14DIF = 0: A7; If ADC14DIF = 1: Ain+ = A6, Ain- = A7</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_8</name>
                                <description>If ADC14DIF = 0: A8; If ADC14DIF = 1: Ain+ = A8, Ain- = A9</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_9</name>
                                <description>If ADC14DIF = 0: A9; If ADC14DIF = 1: Ain+ = A8, Ain- = A9</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_10</name>
                                <description>If ADC14DIF = 0: A10; If ADC14DIF = 1: Ain+ = A10, Ain- = A11</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_11</name>
                                <description>If ADC14DIF = 0: A11; If ADC14DIF = 1: Ain+ = A10, Ain- = A11</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_12</name>
                                <description>If ADC14DIF = 0: A12; If ADC14DIF = 1: Ain+ = A12, Ain- = A13</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_13</name>
                                <description>If ADC14DIF = 0: A13; If ADC14DIF = 1: Ain+ = A12, Ain- = A13</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_14</name>
                                <description>If ADC14DIF = 0: A14; If ADC14DIF = 1: Ain+ = A14, Ain- = A15</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_15</name>
                                <description>If ADC14DIF = 0: A15; If ADC14DIF = 1: Ain+ = A14, Ain- = A15</description>
                                <value>15</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_16</name>
                                <description>If ADC14DIF = 0: A16; If ADC14DIF = 1: Ain+ = A16, Ain- = A17</description>
                                <value>16</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_17</name>
                                <description>If ADC14DIF = 0: A17; If ADC14DIF = 1: Ain+ = A16, Ain- = A17</description>
                                <value>17</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_18</name>
                                <description>If ADC14DIF = 0: A18; If ADC14DIF = 1: Ain+ = A18, Ain- = A19</description>
                                <value>18</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_19</name>
                                <description>If ADC14DIF = 0: A19; If ADC14DIF = 1: Ain+ = A18, Ain- = A19</description>
                                <value>19</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_20</name>
                                <description>If ADC14DIF = 0: A20; If ADC14DIF = 1: Ain+ = A20, Ain- = A21</description>
                                <value>20</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_21</name>
                                <description>If ADC14DIF = 0: A21; If ADC14DIF = 1: Ain+ = A20, Ain- = A21</description>
                                <value>21</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_22</name>
                                <description>If ADC14DIF = 0: A22; If ADC14DIF = 1: Ain+ = A22, Ain- = A23</description>
                                <value>22</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_23</name>
                                <description>If ADC14DIF = 0: A23; If ADC14DIF = 1: Ain+ = A22, Ain- = A23</description>
                                <value>23</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_24</name>
                                <description>If ADC14DIF = 0: A24; If ADC14DIF = 1: Ain+ = A24, Ain- = A25</description>
                                <value>24</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_25</name>
                                <description>If ADC14DIF = 0: A25; If ADC14DIF = 1: Ain+ = A24, Ain- = A25</description>
                                <value>25</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_26</name>
                                <description>If ADC14DIF = 0: A26; If ADC14DIF = 1: Ain+ = A26, Ain- = A27</description>
                                <value>26</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_27</name>
                                <description>If ADC14DIF = 0: A27; If ADC14DIF = 1: Ain+ = A26, Ain- = A27</description>
                                <value>27</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_28</name>
                                <description>If ADC14DIF = 0: A28; If ADC14DIF = 1: Ain+ = A28, Ain- = A29</description>
                                <value>28</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_29</name>
                                <description>If ADC14DIF = 0: A29; If ADC14DIF = 1: Ain+ = A28, Ain- = A29</description>
                                <value>29</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_30</name>
                                <description>If ADC14DIF = 0: A30; If ADC14DIF = 1: Ain+ = A30, Ain- = A31</description>
                                <value>30</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INCH_31</name>
                                <description>If ADC14DIF = 0: A31; If ADC14DIF = 1: Ain+ = A30, Ain- = A31</description>
                                <value>31</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14EOS</name>
                        <description>End of sequence</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14EOS_0</name>
                                <description>Not end of sequence</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14EOS_1</name>
                                <description>End of sequence</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14VRSEL</name>
                        <description>Selects combinations of V(R+) and V(R-) sources</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14VRSEL_0</name>
                                <description>V(R+) = AVCC, V(R-) = AVSS</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14VRSEL_1</name>
                                <description>V(R+) = VREF buffered, V(R-) = AVSS</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14VRSEL_14</name>
                                <description>V(R+) = VeREF+, V(R-) = VeREF-</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14VRSEL_15</name>
                                <description>V(R+) = VeREF+ buffered, V(R-) = VeREF</description>
                                <value>15</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14DIF</name>
                        <description>Differential mode</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14DIF_0</name>
                                <description>Single-ended mode enabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14DIF_1</name>
                                <description>Differential mode enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14WINC</name>
                        <description>Comparator window enable</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14WINC_0</name>
                                <description>Comparator window disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14WINC_1</name>
                                <description>Comparator window enabled</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14WINCTH</name>
                        <description>Window comparator threshold register selection</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>ADC14WINCTH_0</name>
                                <description>Use window comparator thresholds 0, ADC14LO0 and ADC14HI0</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14WINCTH_1</name>
                                <description>Use window comparator thresholds 1, ADC14LO1 and ADC14HI1</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <dim>32</dim>
                  <dimIncrement>4</dimIncrement>
                  <dimIndex>0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25,26,27,28,29,30,31</dimIndex>
                  <name>ADC14MEM[%s]</name>
                  <displayName>MEM[%s]</displayName>
                  <description>Conversion Memory Register</description>
                  <addressOffset>0x98</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000000</resetMask>
                  <fields>
                    <field>
                        <name>Conversion_Results</name>
                        <description>Conversion Result</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
