cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
                        <enumeratedValues>
                            <name>ADC14IFG21_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG21_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG21_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG22</name>
                        <description>ADC14MEM22 interrupt flag</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG22_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG22_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG22_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG23</name>
                        <description>ADC14MEM23 interrupt flag</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG23_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG23_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG23_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG24</name>
                        <description>ADC14MEM24 interrupt flag</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG24_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG24_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG24_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG25</name>
                        <description>ADC14MEM25 interrupt flag</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG25_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG25_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG25_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG26</name>
                        <description>ADC14MEM26 interrupt flag</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG26_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG26_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG26_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG27</name>
                        <description>ADC14MEM27 interrupt flag</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG27_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG27_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG27_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG28</name>
                        <description>ADC14MEM28 interrupt flag</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG28_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG28_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG28_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG29</name>
                        <description>ADC14MEM29 interrupt flag</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG29_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG29_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG29_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG30</name>
                        <description>ADC14MEM30 interrupt flag</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG30_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG30_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG30_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14IFG31</name>
                        <description>ADC14MEM31 interrupt flag</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14IFG31_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14IFG31_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14IFG31_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>ADC14IFGR1</name>
                  <displayName>IFGR1</displayName>
                  <description>Interrupt Flag 1 Register</description>
                  <addressOffset>0x148</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>ADC14INIFG</name>
                        <description>Interrupt flag for ADC14MEMx within comparator window</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14INIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14INIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14INIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14LOIFG</name>
                        <description>Interrupt flag for ADC14MEMx below comparator window</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14LOIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14LOIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14LOIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14HIIFG</name>
                        <description>Interrupt flag for ADC14MEMx above comparator window</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14HIIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14HIIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14HIIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14OVIFG</name>
                        <description>ADC14MEMx overflow interrupt flag</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14OVIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14OVIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14OVIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14TOVIFG</name>
                        <description>ADC14 conversion time overflow interrupt flag</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14TOVIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14TOVIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14TOVIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>ADC14RDYIFG</name>
                        <description>ADC14 local buffered reference ready interrupt flag</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>ADC14RDYIFG_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>ADC14RDYIFG_0</name>
                                <description>No interrupt pending</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>ADC14RDYIFG_1</name>
                                <description>Interrupt pending</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
