cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
        </registers>
    </peripheral>
    <peripheral>
        <name>LCD_F</name>
        <version>356.0</version>
        <description>LCD_F</description>
        <baseAddress>0x40012400</baseAddress>
        <interrupt>
            <name>LCD_F_IRQ</name>
            <description>LCD_F Interrupt</description>
            <value>41</value>
        </interrupt>
        <addressBlock>
            <offset>0x0</offset>
            <size>0x1A8</size>
            <usage>registers</usage>
        </addressBlock>
        <registers>
            <register>
                  <name>LCDCTL</name>
                  <displayName>CTL</displayName>
                  <description>LCD_F control</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LCDON</name>
                        <description>LCD on</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDON_0</name>
                                <description>LCD module off</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDON_1</name>
                                <description>LCD module on</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDLP</name>
                        <description>LCD Low-power Waveform</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDLP_0</name>
                                <description>Standard LCD waveforms on segment and common lines selected</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDLP_1</name>
                                <description>Low-power LCD waveforms on segment and common lines selected</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDSON</name>
                        <description>LCD segments on</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDSON_0</name>
                                <description>All LCD segments are off</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDSON_1</name>
                                <description>All LCD segments are enabled and on or off according to their corresponding memory location</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDMXx</name>
                        <description>LCD mux rate</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDMXx_0</name>
                                <description>Static</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDMXx_1</name>
                                <description>2-mux</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDMXx_2</name>
                                <description>3-mux</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDMXx_3</name>
                                <description>4-mux</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDMXx_4</name>
                                <description>5-mux</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDMXx_5</name>
                                <description>6-mux</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDMXx_6</name>
                                <description>7-mux</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDMXx_7</name>
                                <description>8-mux</description>
                                <value>7</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDPREx</name>
                        <description>LCD frequency pre-scaler</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x3</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDPREx_0</name>
                                <description>Divide by 1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDPREx_1</name>
                                <description>Divide by 2</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDPREx_2</name>
                                <description>Divide by 4</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDPREx_3</name>
                                <description>Divide by 8</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDPREx_4</name>
                                <description>Divide by 16</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDPREx_5</name>
                                <description>Divide by 32</description>
                                <value>5</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDDIVx</name>
                        <description>LCD frequency divider</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x5</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDDIVx_0</name>
                                <description>Divide by 1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_1</name>
                                <description>Divide by 2</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_2</name>
                                <description>Divide by 3</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_3</name>
                                <description>Divide by 4</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_4</name>
                                <description>Divide by 5</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_5</name>
                                <description>Divide by 6</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_6</name>
                                <description>Divide by 7</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_7</name>
                                <description>Divide by 8</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_8</name>
                                <description>Divide by 9</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_9</name>
                                <description>Divide by 10</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_10</name>
                                <description>Divide by 11</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_11</name>
                                <description>Divide by 12</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_12</name>
                                <description>Divide by 13</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_13</name>
                                <description>Divide by 14</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_14</name>
                                <description>Divide by 15</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_15</name>
                                <description>Divide by 16</description>
                                <value>15</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_16</name>
                                <description>Divide by 17</description>
                                <value>16</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_17</name>
                                <description>Divide by 18</description>
                                <value>17</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_18</name>
                                <description>Divide by 19</description>
                                <value>18</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_19</name>
                                <description>Divide by 20</description>
                                <value>19</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_20</name>
                                <description>Divide by 21</description>
                                <value>20</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_21</name>
                                <description>Divide by 22</description>
                                <value>21</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_22</name>
                                <description>Divide by 23</description>
                                <value>22</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_23</name>
                                <description>Divide by 24</description>
                                <value>23</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_24</name>
                                <description>Divide by 25</description>
                                <value>24</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_25</name>
                                <description>Divide by 26</description>
                                <value>25</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_26</name>
                                <description>Divide by 27</description>
                                <value>26</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_27</name>
                                <description>Divide by 28</description>
                                <value>27</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_28</name>
                                <description>Divide by 29</description>
                                <value>28</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_29</name>
                                <description>Divide by 30</description>
                                <value>29</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_30</name>
                                <description>Divide by 31</description>
                                <value>30</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDDIVx_31</name>
                                <description>Divide by 32</description>
                                <value>31</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDSSEL</name>
                        <description>Clock source select</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDSSEL_0</name>
                                <description>ACLK</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDSSEL_1</name>
                                <description>VLOCLK</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDSSEL_2</name>
                                <description>REFOCLK</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDSSEL_3</name>
                                <description>LFXTCLK</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
