cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
            <register>
                  <name>LCDPCTL0</name>
                  <displayName>PCTL0</displayName>
                  <description>LCD_F port control 0</description>
                  <addressOffset>0xC</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>LCDS0</name>
                        <description>LCD pin 0 enable</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS0_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS0_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS1</name>
                        <description>LCD pin 1 enable</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS1_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS1_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS2</name>
                        <description>LCD pin 2 enable</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS2_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS2_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS3</name>
                        <description>LCD pin 3 enable</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS3_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS3_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS4</name>
                        <description>LCD pin 4 enable</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS4_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS4_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS5</name>
                        <description>LCD pin 5 enable</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS5_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS5_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS6</name>
                        <description>LCD pin 6 enable</description>
                        <bitOffset>0x6</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS6_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS6_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS7</name>
                        <description>LCD pin 7 enable</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS7_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS7_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS8</name>
                        <description>LCD pin 8 enable</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS8_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS8_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS9</name>
                        <description>LCD pin 9 enable</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS9_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS9_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS10</name>
                        <description>LCD pin 10 enable</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS10_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS10_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS11</name>
                        <description>LCD pin 11 enable</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS11_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS11_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS12</name>
                        <description>LCD pin 12 enable</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS12_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS12_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS13</name>
                        <description>LCD pin 13 enable</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS13_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS13_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS14</name>
                        <description>LCD pin 14 enable</description>
                        <bitOffset>0xE</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS14_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS14_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS15</name>
                        <description>LCD pin 15 enable</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS15_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS15_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS16</name>
                        <description>LCD pin 16 enable</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS16_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS16_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS17</name>
                        <description>LCD pin 17 enable</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS17_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS17_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS18</name>
                        <description>LCD pin 18 enable</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS18_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS18_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS19</name>
                        <description>LCD pin 19 enable</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS19_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS19_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS20</name>
                        <description>LCD pin 20 enable</description>
                        <bitOffset>0x14</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS20_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS20_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS21</name>
                        <description>LCD pin 21 enable</description>
                        <bitOffset>0x15</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS21_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS21_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS22</name>
                        <description>LCD pin 22 enable</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS22_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>LCDS22_1</name>
                                <description>Pins are LCD functions</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>LCDS23</name>
                        <description>LCD pin 23 enable</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>LCDS23_0</name>
                                <description>Multiplexed pins are port functions</description>
                                <value>0</value>
                            </enumeratedValue>
