cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
            <register>
                  <name>DWT_FUNCTION1</name>
                  <displayName>FUNCTION1</displayName>
                  <description>DWT Function Register 1</description>
                  <addressOffset>0x38</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>FUNCTION</name>
                        <description>Function settings. Note 1: If the ETM is not fitted, then ETM trigger is not possible. Note 2: Data value is only sampled for accesses that do not fault (MPU or bus fault). The PC is sampled irrespective of any faults. The PC is only sampled for the first address of a burst. Note 3: FUNCTION is overridden for comparators given by DATAVADDR0 and DATAVADDR1 in DWT_FUNCTION1if DATAVMATCH is also set in DWT_FUNCTION1. The comparators given by DATAVADDR0 and DATAVADDR1 can then only perform address comparator matches for comparator 1 data matches. Note 4: If the data matching functionality is not included during implementation it is not possible to set DATAVADDR0, DATAVADDR1, or DATAVMATCH in DWT_FUNCTION1. This means that the data matching functionality is not available in the implementation. Test the availability of data matching by writing and reading the DATAVMATCH bit in DWT_FUNCTION1. If it is not settable then data matching is unavailable. Note 5: PC match is not recommended for watchpoints because it stops after the instruction. It mainly guards and triggers the ETM.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0000</name>
                                <description>Disabled</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0001</name>
                                <description>EMITRANGE = 0, sample and emit PC through ITM. EMITRANGE = 1, emit address offset through ITM</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0010</name>
                                <description>EMITRANGE = 0, emit data through ITM on read and write. EMITRANGE = 1, emit data and address offset through ITM on read or write.</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0011</name>
                                <description>EMITRANGE = 0, sample PC and data value through ITM on read or write. EMITRANGE = 1, emit address offset and data value through ITM on read or write.</description>
                                <value>3</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0100</name>
                                <description>Watchpoint on PC match.</description>
                                <value>4</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0101</name>
                                <description>Watchpoint on read.</description>
                                <value>5</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0110</name>
                                <description>Watchpoint on write.</description>
                                <value>6</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b0111</name>
                                <description>Watchpoint on read or write.</description>
                                <value>7</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1000</name>
                                <description>ETM trigger on PC match</description>
                                <value>8</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1001</name>
                                <description>ETM trigger on read</description>
                                <value>9</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1010</name>
                                <description>ETM trigger on write</description>
                                <value>10</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1011</name>
                                <description>ETM trigger on read or write</description>
                                <value>11</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1100</name>
                                <description>EMITRANGE = 0, sample data for read transfers. EMITRANGE = 1, sample Daddr [15:0] for read transfers</description>
                                <value>12</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1101</name>
                                <description>EMITRANGE = 0, sample data for write transfers. EMITRANGE = 1, sample Daddr [15:0] for write transfers</description>
                                <value>13</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1110</name>
                                <description>EMITRANGE = 0, sample PC + data for read transfers. EMITRANGE = 1, sample Daddr [15:0] + data for read transfers</description>
                                <value>14</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1111</name>
                                <description>EMITRANGE = 0, sample PC + data for write transfers. EMITRANGE = 1, sample Daddr [15:0] + data for write transfers</description>
                                <value>15</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>EMITRANGE</name>
                        <description>Emit range field. Reserved to permit emitting offset when range match occurs. Reset clears the EMITRANGE bit. PC sampling is not supported when EMITRANGE is enabled. EMITRANGE only applies for: FUNCTION = b0001, b0010, b0011, b1100, b1101, b1110, and b1111.</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>CYCMATCH</name>
                        <description>Only available in comparator 0. When set, this comparator compares against the clock cycle counter.</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DATAVMATCH</name>
                        <description>This bit is only available in comparator 1. When DATAVMATCH is set, this comparator performs data value compares. The comparators given by DATAVADDR0 and DATAVADDR1provide the address for the data comparison. If DATAVMATCH is set in DWT_FUNCTION1, the FUNCTION setting for the comparators given by DATAVADDR0 and DATAVADDR1 are overridden and those comparators only provide the address match for the data comparison.</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LNK1ENA</name>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>DATAVADDR1 not supported</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>DATAVADDR1 supported (enabled).</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DATAVSIZE</name>
                        <description>Defines the size of the data in the COMP register that is to be matched:</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x2</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b00</name>
                                <description>byte</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b01</name>
                                <description>halfword</description>
                                <value>1</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b10</name>
                                <description>word</description>
                                <value>2</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b11</name>
                                <description>Unpredictable.</description>
                                <value>3</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DATAVADDR0</name>
                        <description>Identity of a linked address comparator for data value matching when DATAVMATCH == 1.</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DATAVADDR1</name>
                        <description>Identity of a second linked address comparator for data value matching when DATAVMATCH == 1 and LNK1ENA == 1.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MATCHED</name>
                        <description>This bit is set when the comparator matches, and indicates that the operation defined by FUNCTION has occurred since this bit was last read. This bit is cleared on read.</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DWT_COMP2</name>
                  <displayName>COMP2</displayName>
                  <description>DWT Comparator Register 2</description>
                  <addressOffset>0x40</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>COMP</name>
                        <description>Data value to compare against PC and the data address as given by DWT_FUNCTION2.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DWT_MASK2</name>
                  <displayName>MASK2</displayName>
                  <description>DWT Mask Register 2</description>
                  <addressOffset>0x44</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>MASK</name>
                        <description>Mask on data address when matching against COMP. This is the size of the ignore mask. hat is, DWT matching is performed as:(ADDR ANDed with (~0 left bit-shifted by MASK)) == COMP. However, the actual comparison is slightly more complex to enable matching an address wherever it appears on a bus. So, if COMP is 3, this matches a word access of 0, because 3 would be within the word.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x4</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
