cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
            <register>
                  <name>CFSR</name>
                  <displayName>CFSR</displayName>
                  <description>Configurable Fault Status Registers</description>
                  <addressOffset>0xD28</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>IACCVIOL</name>
                        <description>Instruction access violation flag. Attempting to fetch an instruction from a location that does not permit execution sets the IACCVIOL flag. This occurs on any access to an XN region, even when the MPU is disabled or not present. The return PC points to the faulting instruction. The MMAR is not written.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DACCVIOL</name>
                        <description>Data access violation flag. Attempting to load or store at a location that does not permit the operation sets the DACCVIOL flag. The return PC points to the faulting instruction. This error loads MMAR with the address of the attempted access.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MUNSTKERR</name>
                        <description>Unstack from exception return has caused one or more access violations. This is chained to the handler, so that the original return stack is still present. SP is not adjusted from failing return and new save is not performed. The MMAR is not written.</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MSTKERR</name>
                        <description>Stacking from exception has caused one or more access violations. The SP is still adjusted and the values in the context area on the stack might be incorrect. The MMAR is not written.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MMARVALID</name>
                        <description>Memory Manage Address Register (MMAR) address valid flag. A later-arriving fault, such as a bus fault, can clear a memory manage fault.. If a MemManage fault occurs that is escalated to a Hard Fault because of priority, the Hard Fault handler must clear this bit. This prevents problems on return to a stacked active MemManage handler whose MMAR value has been overwritten.</description>
                        <bitOffset>0x7</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IBUSERR</name>
                        <description>Instruction bus error flag. The IBUSERR flag is set by a prefetch error. The fault stops on the instruction, so if the error occurs under a branch shadow, no fault occurs. The BFAR is not written.</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>PRECISERR</name>
                        <description>Precise data bus error return.</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>IMPRECISERR</name>
                        <description>Imprecise data bus error. It is a BusFault, but the Return PC is not related to the causing instruction. This is not a synchronous fault. So, if detected when the priority of the current activation is higher than the Bus Fault, it only pends. Bus fault activates when returning to a lower priority activation. If a precise fault occurs before returning to a lower priority exception, the handler detects both IMPRECISERR set and one of the precise fault status bits set at the same time. The BFAR is not written.</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UNSTKERR</name>
                        <description>Unstack from exception return has caused one or more bus faults. This is chained to the handler, so that the original return stack is still present. SP is not adjusted from failing return and new save is not performed. The BFAR is not written.</description>
                        <bitOffset>0xB</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>STKERR</name>
                        <description>Stacking from exception has caused one or more bus faults. The SP is still adjusted and the values in the context area on the stack might be incorrect. The BFAR is not written.</description>
                        <bitOffset>0xC</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>BFARVALID</name>
                        <description>This bit is set if the Bus Fault Address Register (BFAR) contains a valid address. This is true after a bus fault where the address is known. Other faults can clear this bit, such as a Mem Manage fault occurring later. If a Bus fault occurs that is escalated to a Hard Fault because of priority, the Hard Fault handler must clear this bit. This prevents problems if returning to a stacked active Bus fault handler whose BFAR value has been overwritten.</description>
                        <bitOffset>0xF</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UNDEFINSTR</name>
                        <description>The UNDEFINSTR flag is set when the processor attempts to execute an undefined instruction. This is an instruction that the processor cannot decode. The return PC points to the undefined instruction.</description>
                        <bitOffset>0x10</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INVSTATE</name>
                        <description>Invalid combination of EPSR and instruction, for reasons other than UNDEFINED instruction. Return PC points to faulting instruction, with the invalid state.</description>
                        <bitOffset>0x11</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>INVPC</name>
                        <description>Attempt to load EXC_RETURN into PC illegally. Invalid instruction, invalid context, invalid value. The return PC points to the instruction that tried to set the PC.</description>
                        <bitOffset>0x12</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>NOCP</name>
                        <description>Attempt to use a coprocessor instruction. The processor does not support coprocessor instructions.</description>
                        <bitOffset>0x13</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>UNALIGNED</name>
                        <description>When UNALIGN_TRP is enabled (see Configuration Control Register on page 8-26), and there is an attempt to make an unaligned memory access, then this fault occurs. Unaligned LDM/STM/LDRD/STRD instructions always fault irrespective of the setting of UNALIGN_TRP.</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DIVBYZERO</name>
                        <description>When DIV_0_TRP (see Configuration Control Register on page 8-26) is enabled and an SDIV or UDIV instruction is used with a divisor of 0, this fault occurs The instruction is executed and the return PC points to it. If DIV_0_TRP is not set, then the divide returns a quotient of 0.</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>MLSPERR</name>
                        <description>Indicates if MemManage fault occurred during FP lazy state preservation.</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>LSPERR</name>
                        <description>Indicates if bus fault occurred during FP lazy state preservation.</description>
                        <bitOffset>0xD</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>HFSR</name>
                  <displayName>HFSR</displayName>
                  <description>Hard Fault Status Register</description>
                  <addressOffset>0xD2C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>VECTTBL</name>
                        <description>This bit is set if there is a fault because of vector table read on exception processing (Bus Fault). This case is always a Hard Fault. The return PC points to the pre-empted instruction.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>FORCED</name>
                        <description>Hard Fault activated because a Configurable Fault was received and cannot activate because of priority or because the Configurable Fault is disabled. The Hard Fault handler then has to read the other fault status registers to determine cause.</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>DEBUGEVT</name>
                        <description>This bit is set if there is a fault related to debug. This is only possible when halting debug is not enabled. For monitor enabled debug, it only happens for BKPT when the current priority is higher than the monitor. When both halting and monitor debug are disabled, it only happens for debug events that are not ignored (minimally, BKPT). The Debug Fault Status Register is updated.</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>DFSR</name>
                  <displayName>DFSR</displayName>
                  <description>Debug Fault Status Register</description>
                  <addressOffset>0xD30</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>HALTED</name>
                        <description>Halt request flag. The processor is halted on the next instruction.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>no halt request</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>halt requested by NVIC, including step</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BKPT</name>
                        <description>BKPT flag. The BKPT flag is set by a BKPT instruction in flash patch code, and also by normal code. Return PC points to breakpoint containing instruction.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>no BKPT instruction execution</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>BKPT instruction execution</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>DWTTRAP</name>
                        <description>Data Watchpoint and Trace (DWT) flag. The processor stops at the current instruction or at the next instruction.</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>no DWT match</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>DWT match</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>VCATCH</name>
                        <description>Vector catch flag. When the VCATCH flag is set, a flag in one of the local fault status registers is also set to indicate the type of fault.</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>no vector catch occurred</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>vector catch occurred</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>EXTERNAL</name>
                        <description>External debug request flag. The processor stops on next instruction boundary.</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>en_0b0</name>
                                <description>EDBGRQ signal not asserted</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>en_0b1</name>
                                <description>EDBGRQ signal asserted</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>MMFAR</name>
                  <displayName>MMFAR</displayName>
                  <description>Mem Manage Fault Address Register</description>
                  <addressOffset>0xD34</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>ADDRESS</name>
                        <description>Mem Manage fault address field. ADDRESS is the data address of a faulted load or store attempt. When an unaligned access faults, the address is the actual address that faulted. Because an access can be split into multiple parts, each aligned, this address can be any offset in the range of the requested size. Flags in the Memory Manage Fault Status Register indicate the cause of the fault</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>BFAR</name>
                  <displayName>BFAR</displayName>
                  <description>Bus Fault Address Register</description>
                  <addressOffset>0xD38</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>ADDRESS</name>
                        <description>Bus fault address field. ADDRESS is the data address of a faulted load or store attempt. When an unaligned access faults, the address is the address requested by the instruction, even if that is not the address that faulted. Flags in the Bus Fault Status Register indicate the cause of the fault</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>AFSR</name>
                  <displayName>AFSR</displayName>
                  <description>Auxiliary Fault Status Register</description>
                  <addressOffset>0xD3C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                    <field>
                        <name>IMPDEF</name>
                        <description>Implementation defined. The bits map directly onto the signal assignment to the AUXFAULT inputs.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
