cmsis-svd/cmsis-svd/data/TexasInstruments/MSP432P411V.svd
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK117_EN_1</name>
                                <description>Block117 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK118_EN</name>
                        <description>When 1, Block118 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x16</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK118_EN_0</name>
                                <description>Block118 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK118_EN_1</name>
                                <description>Block118 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK119_EN</name>
                        <description>When 1, Block119 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x17</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK119_EN_0</name>
                                <description>Block119 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK119_EN_1</name>
                                <description>Block119 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK120_EN</name>
                        <description>When 1, Block120 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x18</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK120_EN_0</name>
                                <description>Block120 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK120_EN_1</name>
                                <description>Block120 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK121_EN</name>
                        <description>When 1, Block121 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x19</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK121_EN_0</name>
                                <description>Block121 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK121_EN_1</name>
                                <description>Block121 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK122_EN</name>
                        <description>When 1, Block122 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1A</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK122_EN_0</name>
                                <description>Block122 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK122_EN_1</name>
                                <description>Block122 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK123_EN</name>
                        <description>When 1, Block123 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1B</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK123_EN_0</name>
                                <description>Block123 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK123_EN_1</name>
                                <description>Block123 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK124_EN</name>
                        <description>When 1, Block124 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1C</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK124_EN_0</name>
                                <description>Block124 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK124_EN_1</name>
                                <description>Block124 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK125_EN</name>
                        <description>When 1, Block125 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1D</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK125_EN_0</name>
                                <description>Block125 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK125_EN_1</name>
                                <description>Block125 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK126_EN</name>
                        <description>When 1, Block126 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1E</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK126_EN_0</name>
                                <description>Block126 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK126_EN_1</name>
                                <description>Block126 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLK127_EN</name>
                        <description>When 1, Block127 of the SRAM is retained in LPM3 and LPM4</description>
                        <bitOffset>0x1F</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                        <enumeratedValues>
                            <enumeratedValue>
                                <name>BLK127_EN_0</name>
                                <description>Block127 of the SRAM is not retained in LPM3 or LPM4</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLK127_EN_1</name>
                                <description>Block127 of the SRAM is retained in LPM3 and LPM4</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_SRAM_STAT</name>
                  <displayName>SRAM_STAT</displayName>
                  <description>SRAM Status Register</description>
                  <addressOffset>0x90</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>BNKEN_RDY</name>
                        <description>When 1, indicates SRAM is ready for access and banks can be enabled/disabled.</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>BNKEN_RDY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>BNKEN_RDY_0</name>
                                <description>SRAM is not ready for accesses. Banks are undergoing an enable or
disable sequence, and reads or writes to SRAM are stalled until the banks are
ready.</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BNKEN_RDY_1</name>
                                <description>SRAM is ready for accesses. All SRAM banks are enabled/disabled
according to values of registers SYS_SRAM_BANKEN_CTLx (x=0,1,2,3)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                    <field>
                        <name>BLKRET_RDY</name>
                        <description>When 1, indicates SRAM is ready for access and blocks can be enabled/disabled for retention.</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                        <enumeratedValues>
                            <name>BLKRET_RDY_enum_read</name>
                            <usage>read</usage>
                            <enumeratedValue>
                                <name>BLKRET_RDY_0</name>
                                <description>SRAM blocks are being set up for retention. Entry into LPM3, LPM4 should
not be attempted until this bit is set to 1</description>
                                <value>0</value>
                            </enumeratedValue>
                            <enumeratedValue>
                                <name>BLKRET_RDY_1</name>
                                <description>SRAM is ready for accesses. All SRAM blocks are enabled/disabled for
retention according to values of registers SYS_SRAM_BLKRET_CTLx
(x = 0,1,2,3)</description>
                                <value>1</value>
                            </enumeratedValue>
                        </enumeratedValues>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_MASTER_UNLOCK</name>
                  <displayName>MASTER_UNLOCK</displayName>
                  <description>Master Unlock Register</description>
                  <addressOffset>0x1000</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>UNLKEY</name>
                        <description>Unlock Key</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x10</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <dim>2</dim>
                  <dimIncrement>4</dimIncrement>
                  <dimIndex>0,1</dimIndex>
                  <name>SYS_BOOTOVER_REQ[%s]</name>
                  <displayName>BOOTOVER_REQ[%s]</displayName>
                  <description>Boot Override Request Register</description>
                  <addressOffset>0x1004</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>REGVAL</name>
                        <description>Value set by debugger, read and clear by the CPU</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_BOOTOVER_ACK</name>
                  <displayName>BOOTOVER_ACK</displayName>
                  <description>Boot Override Acknowledge Register</description>
                  <addressOffset>0x100C</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0xffffffff</resetMask>
                  <fields>
                    <field>
                        <name>REGVAL</name>
                        <description>Value set by CPU, read/clear by the debugger</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x20</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_RESET_REQ</name>
                  <displayName>RESET_REQ</displayName>
                  <description>Reset Request Register</description>
                  <addressOffset>0x1010</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <fields>
                    <field>
                        <name>POR</name>
                        <description>Generate POR</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>REBOOT</name>
                        <description>Generate Reboot_Reset</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>write-only</access>
                    </field>
                    <field>
                        <name>WKEY</name>
                        <description>Write key</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x8</bitWidth>
                        <access>write-only</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_RESET_STATOVER</name>
                  <displayName>RESET_STATOVER</displayName>
                  <description>Reset Status and Override Register</description>
                  <addressOffset>0x1014</addressOffset>
                  <size>32</size>
                  <access>read-write</access>
                  <resetValue>0x00000000</resetValue>
                  <resetMask>0x00000700</resetMask>
                  <fields>
                    <field>
                        <name>SOFT</name>
                        <description>Indicates if SOFT Reset is active</description>
                        <bitOffset>0x0</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>HARD</name>
                        <description>Indicates if HARD Reset is active</description>
                        <bitOffset>0x1</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>REBOOT</name>
                        <description>Indicates if Reboot Reset is active</description>
                        <bitOffset>0x2</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>SOFT_OVER</name>
                        <description>SOFT_Reset overwrite request</description>
                        <bitOffset>0x8</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>HARD_OVER</name>
                        <description>HARD_Reset overwrite request</description>
                        <bitOffset>0x9</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                    <field>
                        <name>RBT_OVER</name>
                        <description>Reboot Reset overwrite request</description>
                        <bitOffset>0xA</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-write</access>
                    </field>
                  </fields>
            </register>
            <register>
                  <name>SYS_SYSTEM_STAT</name>
                  <displayName>SYSTEM_STAT</displayName>
                  <description>System Status Register</description>
                  <addressOffset>0x1020</addressOffset>
                  <size>32</size>
                  <access>read-only</access>
                  <fields>
                    <field>
                        <name>DBG_SEC_ACT</name>
                        <description>Debug Security active</description>
                        <bitOffset>0x3</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>JTAG_SWD_LOCK_ACT</name>
                        <description>Indicates if JTAG and SWD Lock is active</description>
                        <bitOffset>0x4</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                    <field>
                        <name>IP_PROT_ACT</name>
                        <description>Indicates if IP protection is active</description>
                        <bitOffset>0x5</bitOffset>
                        <bitWidth>0x1</bitWidth>
                        <access>read-only</access>
                    </field>
                  </fields>
            </register>
        </registers>
    </peripheral>
   </peripherals>
</device>


